//******************************************************************************
//******************************************************************************
//**                                                                          **
//** Copyright(C) 2020-2021, XCradle Electronic Information Industry Co., Ltd. **
//**                                                                          **
//**                          All Rights Reserved.                            **
//**                                                                          **
//******************************************************************************
//******************************************************************************

//******************************************************************************
// [File] XCradleChsTerminal.uni
// [Description] Add XCradle Chinese STR define in this file
// [Author] JSY-ZZP
// [Date] 2021/02/25
//******************************************************************************
/=#
#langdef   x-AMI "x-AMI"
#langdef   en-US "English"
#langdef   zh-chs "中文 (简体)"

#string STR_NONE                            #language zh-chs "无"
#string STR_TERMINAL_FORM_TITLE                #language zh-chs "串口控制台重定向"
#string STR_CONSOLE_REDIRECTION_SETTINGS       #language zh-chs "串口控制台重定向设置"
#string STR_CONSOLE_REDIRECTION_SETTINGS_HELP #language zh-chs "设置宿主端计算机与远端计算机如何交换数据，两边的设备必须一样或者兼容。"
#string STR_CONSOLE_REDIRECTION             #language zh-chs "控制台重定向"
#string STR_CONSOLE_REDIRECTION_PORT0x0     #language zh-chs "控制台重定向"
#string STR_CONSOLE_REDIRECTION_PORT0x1     #language zh-chs "控制台重定向"
#string STR_CONSOLE_REDIRECTION_PORT0x2     #language zh-chs "控制台重定向"
#string STR_CONSOLE_REDIRECTION_PORT0x3     #language zh-chs "控制台重定向"
#string STR_CONSOLE_REDIRECTION_PORT0x4     #language zh-chs "控制台重定向"
#string STR_CONSOLE_REDIRECTION_PORT0x5     #language zh-chs "控制台重定向"
#string STR_CONSOLE_REDIRECTION_PORT0x6     #language zh-chs "控制台重定向"
#string STR_CONSOLE_REDIRECTION_PORT0x7     #language zh-chs "控制台重定向"
#string STR_CONSOLE_REDIRECTION_PORT0x8     #language zh-chs "控制台重定向"
#string STR_CONSOLE_REDIRECTION_PORT0x9     #language zh-chs "控制台重定向"
#string STR_CONSOLE_REDIRECTION_PORT0xa     #language zh-chs "控制台重定向"
#string STR_CONSOLE_REDIRECTION_PORT0xb     #language zh-chs "控制台重定向"
#string STR_CONSOLE_REDIRECTION_PORT0xc     #language zh-chs "控制台重定向"
#string STR_CONSOLE_REDIRECTION_PORT0xd     #language zh-chs "控制台重定向"
#string STR_DEBUGGER_CONSOLE_REDIRECTION    #language zh-chs "控制台重定向"
#string STR_CONSOLE_REDIRECTION_EMS         #language zh-chs "控制台重定向 EMS"
#string STR_CONSOLE_REDIRECTION_ENABLE_HELP #language zh-chs "启用或禁用控制台重定向功能。"
#string STR_NO_SERIAL_PORTS_PRESENT         #language zh-chs "未发现串行端口"
#string STR_PORT_IS_DISABLED                #language zh-chs "端口已禁用"
#string STR_COM_DISABLED                    #language zh-chs "禁用"
#string STR_SIO_SERIAL_PORT0                #language zh-chs "串口0"
#string STR_SIO_SERIAL_PORT1                #language zh-chs "串口1"
#string STR_SIO_SERIAL_PORT2                #language zh-chs "串口2"
#string STR_SIO_SERIAL_PORT3                #language zh-chs "串口3"
#string STR_SIO_SERIAL_PORT4                #language zh-chs "串口4"
#string STR_SIO_SERIAL_PORT5                #language zh-chs "串口5"
#string STR_SIO_SERIAL_PORT6                #language zh-chs "串口6"
#string STR_SIO_SERIAL_PORT7                #language zh-chs "串口7"
#string STR_SIO_SERIAL_PORT8                #language zh-chs "串口8"
#string STR_SIO_SERIAL_PORT9                #language zh-chs "串口9"
#string STR_TERMINAL_TYPE_EMS               #language zh-chs "终端类型 EMS"
#string STR_TERMINAL_TYPE_PORT0x0           #language zh-chs "终端类型"
#string STR_TERMINAL_TYPE_PORT0x1           #language zh-chs "终端类型"
#string STR_TERMINAL_TYPE_PORT0x2           #language zh-chs "终端类型"
#string STR_TERMINAL_TYPE_PORT0x3           #language zh-chs "终端类型"
#string STR_TERMINAL_TYPE_PORT0x4           #language zh-chs "终端类型"
#string STR_TERMINAL_TYPE_PORT0x5           #language zh-chs "终端类型"
#string STR_TERMINAL_TYPE_PORT0x6           #language zh-chs "终端类型"
#string STR_TERMINAL_TYPE_PORT0x7           #language zh-chs "终端类型"
#string STR_TERMINAL_TYPE_PORT0x8           #language zh-chs "终端类型"
#string STR_TERMINAL_TYPE_PORT0x9           #language zh-chs "终端类型"
#string STR_TERMINAL_TYPE_PORT0xa           #language zh-chs "终端类型"
#string STR_TERMINAL_TYPE_PORT0xb           #language zh-chs "终端类型"
#string STR_TERMINAL_TYPE_PORT0xc           #language zh-chs "终端类型"
#string STR_TERMINAL_TYPE_PORT0xd           #language zh-chs "终端类型"
#string STR_TERMINAL_TYPE_HELP              #language zh-chs "仿真:ANSI:扩展的ASCII字符集。VT100:ASCII字符集合。VT100 +:扩展的VT100，支持颜色,功能键等。VT-UTF8:使用 UTF8编码将Unicode字符映射到1或多个字节。"
#string STR_BAUD_RATE_EMS                   #language zh-chs "波特率"
#string STR_BAUD_RATE_PORT0x0               #language zh-chs "波特率"
#string STR_BAUD_RATE_PORT0x1               #language zh-chs "波特率"
#string STR_BAUD_RATE_PORT0x2               #language zh-chs "波特率"
#string STR_BAUD_RATE_PORT0x3               #language zh-chs "波特率"
#string STR_BAUD_RATE_PORT0x4               #language zh-chs "波特率"
#string STR_BAUD_RATE_PORT0x5               #language zh-chs "波特率"
#string STR_BAUD_RATE_PORT0x6               #language zh-chs "波特率"
#string STR_BAUD_RATE_PORT0x7               #language zh-chs "波特率"
#string STR_BAUD_RATE_PORT0x8               #language zh-chs "波特率"
#string STR_BAUD_RATE_PORT0x9               #language zh-chs "波特率"
#string STR_BAUD_RATE_PORT0xa               #language zh-chs "波特率"
#string STR_BAUD_RATE_PORT0xb               #language zh-chs "波特率"
#string STR_BAUD_RATE_PORT0xc               #language zh-chs "波特率"
#string STR_BAUD_RATE_PORT0xd               #language zh-chs "波特率"
#string STR_BAUD_RATE_HELP                  #language zh-chs "选择串口传输速率。两边的速率必须匹配。较长或者有干扰的线路可能需要降低速率。"
#string STR_DATA_BITS_EMS                   #language zh-chs "数据位 EMS"
#string STR_DATA_BITS_PORT0x0               #language zh-chs "数据位"
#string STR_DATA_BITS_PORT0x1               #language zh-chs "数据位"
#string STR_DATA_BITS_PORT0x2               #language zh-chs "数据位"
#string STR_DATA_BITS_PORT0x3               #language zh-chs "数据位"
#string STR_DATA_BITS_PORT0x4               #language zh-chs "数据位"
#string STR_DATA_BITS_HELP                  #language zh-chs "数据位"
#string STR_PARITY_EMS                      #language zh-chs "校验位 EMS"
#string STR_PARITY_PORT0x0                  #language zh-chs "校验位"
#string STR_PARITY_PORT0x1                  #language zh-chs "校验位"
#string STR_PARITY_PORT0x2                  #language zh-chs "校验位"
#string STR_PARITY_PORT0x3                  #language zh-chs "校验位"
#string STR_PARITY_PORT0x4                  #language zh-chs "校验位"
#string STR_PARITY_PORT0x5                  #language zh-chs "校验位"
#string STR_PARITY_PORT0x6                  #language zh-chs "校验位"
#string STR_PARITY_PORT0x7                  #language zh-chs "校验位"
#string STR_PARITY_PORT0x8                  #language zh-chs "校验位"
#string STR_PARITY_PORT0x9                  #language zh-chs "校验位"
#string STR_PARITY_PORT0xa                  #language zh-chs "校验位"
#string STR_PARITY_PORT0xb                  #language zh-chs "校验位"
#string STR_PARITY_PORT0xc                  #language zh-chs "校验位"
#string STR_PARITY_PORT0xd                  #language zh-chs "校验位"
#string STR_PARITY_HELP                     #language zh-chs "可以发送一个奇偶校验位来检测一些传输错误。偶校验:如果数字1的数据位个数为偶数，则校验位是0。奇校验:如果数字1的数据位个数为奇数，则校验位是1。标记:校验位总是1。空格:校验位总是0。Mark和Space设置不允许用来错误检测。他们可以作为一个额外的数据。"
#string STR_ODD                             #language zh-chs "奇校验"
#string STR_EVEN                            #language zh-chs "偶校验"
#string STR_MARK                            #language zh-chs "标记"
#string STR_SPACE                           #language zh-chs "空格"
#string STR_STOP_BITS_PORT0x0               #language zh-chs "停止位"
#string STR_STOP_BITS_PORT0x1               #language zh-chs "停止位"
#string STR_STOP_BITS_PORT0x2               #language zh-chs "停止位"
#string STR_STOP_BITS_PORT0x3               #language zh-chs "停止位"
#string STR_STOP_BITS_PORT0x4               #language zh-chs "停止位"
#string STR_STOP_BITS_PORT0x5               #language zh-chs "停止位"
#string STR_STOP_BITS_PORT0x6               #language zh-chs "停止位"
#string STR_STOP_BITS_PORT0x7               #language zh-chs "停止位"
#string STR_STOP_BITS_PORT0x8               #language zh-chs "停止位"
#string STR_STOP_BITS_PORT0x9               #language zh-chs "停止位"
#string STR_STOP_BITS_PORT0xa               #language zh-chs "停止位"
#string STR_STOP_BITS_PORT0xb               #language zh-chs "停止位"
#string STR_STOP_BITS_PORT0xc               #language zh-chs "停止位"
#string STR_STOP_BITS_PORT0xd               #language zh-chs "停止位"
#string STR_STOP_BITS_HELP                  #language zh-chs "停止位表示串行数据包的结束。(起始位表示开始)。标准的设置是一个停止位。与慢速设备通信可能需要超过一个停止位。"
#string STR_FLOW_CTRL_PORT0x0               #language zh-chs "流控"
#string STR_FLOW_CTRL_PORT0x1               #language zh-chs "流控"
#string STR_FLOW_CTRL_PORT0x2               #language zh-chs "流控"
#string STR_FLOW_CTRL_PORT0x3               #language zh-chs "流控"
#string STR_FLOW_CTRL_PORT0x4               #language zh-chs "流控"
#string STR_FLOW_CTRL_PORT0x5               #language zh-chs "流控"
#string STR_FLOW_CTRL_PORT0x6               #language zh-chs "流控"
#string STR_FLOW_CTRL_PORT0x7               #language zh-chs "流控"
#string STR_FLOW_CTRL_PORT0x8               #language zh-chs "流控"
#string STR_FLOW_CTRL_PORT0x9               #language zh-chs "流控"
#string STR_FLOW_CTRL_PORT0xa               #language zh-chs "流控"
#string STR_FLOW_CTRL_PORT0xb               #language zh-chs "流控"
#string STR_FLOW_CTRL_PORT0xc               #language zh-chs "流控"
#string STR_FLOW_CTRL_PORT0xd               #language zh-chs "流控"
#string STR_FLOW_CTRL_HELP                  #language zh-chs "当缓冲区溢出时，流控可以防止数据丢失。当发送数据时,如果接收缓冲区满了,一个“停止”的信号被发送以停止数据流。一旦缓冲区空了,发送一个开始的信号来重新启动数据发送流程。硬件流控制使用两条数据线来发送启动/停止信号。"
#string STR_HARDWARE_FLOW_CTRL              #language zh-chs "硬件 RTS/CTS"
#string STR_SOFTWARE_FLOW_CTRL              #language zh-chs "软件Software Xon/Xoff"
#string STR_TERMINAL_RESOLUTION_PORT0x0         #language zh-chs "分辨率100x31"
#string STR_TERMINAL_RESOLUTION_PORT0x1         #language zh-chs "分辨率100x31"
#string STR_TERMINAL_RESOLUTION_PORT0x2         #language zh-chs "分辨率100x31"
#string STR_TERMINAL_RESOLUTION_PORT0x3         #language zh-chs "分辨率100x31"
#string STR_TERMINAL_RESOLUTION_PORT0x4         #language zh-chs "分辨率100x31"
#string STR_TERMINAL_RESOLUTION_PORT0x5         #language zh-chs "分辨率100x31"
#string STR_TERMINAL_RESOLUTION_PORT0x6         #language zh-chs "分辨率100x31"
#string STR_TERMINAL_RESOLUTION_PORT0x7         #language zh-chs "分辨率100x31"
#string STR_TERMINAL_RESOLUTION_PORT0x8         #language zh-chs "分辨率100x31"
#string STR_TERMINAL_RESOLUTION_PORT0x9         #language zh-chs "分辨率100x31"
#string STR_TERMINAL_RESOLUTION_PORT0xa         #language zh-chs "分辨率100x31"
#string STR_TERMINAL_RESOLUTION_PORT0xb         #language zh-chs "分辨率100x31"
#string STR_TERMINAL_RESOLUTION_PORT0xc         #language zh-chs "分辨率100x31"
#string STR_TERMINAL_RESOLUTION_PORT0xd         #language zh-chs "分辨率100x31"
#string STR_TERMINAL_RESOLUTION_HELP            #language zh-chs "启用或禁用扩展终端分辨率"
#string STR_TERMINAL_VTUTF8_PORT0x0             #language zh-chs "VT-UTF8组合键支持"
#string STR_TERMINAL_VTUTF8_PORT0x1             #language zh-chs "VT-UTF8组合键支持"
#string STR_TERMINAL_VTUTF8_PORT0x2             #language zh-chs "VT-UTF8组合键支持"
#string STR_TERMINAL_VTUTF8_PORT0x3             #language zh-chs "VT-UTF8组合键支持"
#string STR_TERMINAL_VTUTF8_PORT0x4             #language zh-chs "VT-UTF8组合键支持"
#string STR_TERMINAL_VTUTF8_PORT0x5             #language zh-chs "VT-UTF8组合键支持"
#string STR_TERMINAL_VTUTF8_PORT0x6             #language zh-chs "VT-UTF8组合键支持"
#string STR_TERMINAL_VTUTF8_PORT0x7             #language zh-chs "VT-UTF8组合键支持"
#string STR_TERMINAL_VTUTF8_PORT0x8             #language zh-chs "VT-UTF8组合键支持"
#string STR_TERMINAL_VTUTF8_PORT0x9             #language zh-chs "VT-UTF8组合键支持"
#string STR_TERMINAL_VTUTF8_PORT0xa             #language zh-chs "VT-UTF8组合键支持"
#string STR_TERMINAL_VTUTF8_PORT0xb             #language zh-chs "VT-UTF8组合键支持"
#string STR_TERMINAL_VTUTF8_PORT0xc             #language zh-chs "VT-UTF8组合键支持"
#string STR_TERMINAL_VTUTF8_PORT0xd             #language zh-chs "VT-UTF8组合键支持"
#string STR_TERMINAL_VTUTF8_HELP                #language zh-chs "启用ANSI/VT100终端的VT-UTF8组合键支持功能"
#string STR_TERMINAL_RECORDER_MODE_PORT0x0      #language zh-chs "记录模式"
#string STR_TERMINAL_RECORDER_MODE_PORT0x1      #language zh-chs "记录模式"
#string STR_TERMINAL_RECORDER_MODE_PORT0x2      #language zh-chs "记录模式"
#string STR_TERMINAL_RECORDER_MODE_PORT0x3      #language zh-chs "记录模式"
#string STR_TERMINAL_RECORDER_MODE_PORT0x4      #language zh-chs "记录模式"
#string STR_TERMINAL_RECORDER_MODE_PORT0x5      #language zh-chs "记录模式"
#string STR_TERMINAL_RECORDER_MODE_PORT0x6      #language zh-chs "记录模式"
#string STR_TERMINAL_RECORDER_MODE_PORT0x7      #language zh-chs "记录模式"
#string STR_TERMINAL_RECORDER_MODE_PORT0x8      #language zh-chs "记录模式"
#string STR_TERMINAL_RECORDER_MODE_PORT0x9      #language zh-chs "记录模式"
#string STR_TERMINAL_RECORDER_MODE_PORT0xa      #language zh-chs "记录模式"
#string STR_TERMINAL_RECORDER_MODE_PORT0xb      #language zh-chs "记录模式"
#string STR_TERMINAL_RECORDER_MODE_PORT0xc      #language zh-chs "记录模式"
#string STR_TERMINAL_RECORDER_MODE_PORT0xd      #language zh-chs "记录模式"
#string STR_TERMINAL_RECORDER_MODE_HELP         #language zh-chs "当启用此模式时，仅发送文本数据。该模式用来捕获终端数据。"
#string STR_DEBUGGER_TERMINAL_TYPE              #language zh-chs "终端类型"
#string STR_PUTTYFUNCTION_KEYPAD_PORT0x0        #language zh-chs "Putty键盘"
#string STR_PUTTYFUNCTION_KEYPAD_PORT0x1        #language zh-chs "Putty键盘"
#string STR_PUTTYFUNCTION_KEYPAD_PORT0x2        #language zh-chs "Putty键盘"
#string STR_PUTTYFUNCTION_KEYPAD_PORT0x3        #language zh-chs "Putty键盘"
#string STR_PUTTYFUNCTION_KEYPAD_PORT0x4        #language zh-chs "Putty键盘"
#string STR_PUTTYFUNCTION_KEYPAD_PORT0x5        #language zh-chs "Putty键盘"
#string STR_PUTTYFUNCTION_KEYPAD_PORT0x6        #language zh-chs "Putty键盘"
#string STR_PUTTYFUNCTION_KEYPAD_PORT0x7        #language zh-chs "Putty键盘"
#string STR_PUTTYFUNCTION_KEYPAD_PORT0x8        #language zh-chs "Putty键盘"
#string STR_PUTTYFUNCTION_KEYPAD_PORT0x9        #language zh-chs "Putty键盘"
#string STR_PUTTYFUNCTION_KEYPAD_PORT0xa        #language zh-chs "Putty键盘"
#string STR_PUTTYFUNCTION_KEYPAD_PORT0xb        #language zh-chs "Putty键盘"
#string STR_PUTTYFUNCTION_KEYPAD_PORT0xc        #language zh-chs "Putty键盘"
#string STR_PUTTYFUNCTION_KEYPAD_PORT0xd        #language zh-chs "Putty键盘"
#string STR_PUTTYFUNCTION_KEYPAD_HELP           #language zh-chs "Putty的功能键和键盘设置。"
#string STR_REDIRECTION_AFTER_BIOS_POST         #language zh-chs "POST后重定向设置"
#string STR_REDIRECTION_AFTER_BIOS_POST_HELP    #language zh-chs "如果设定为引导模式，则在进入传统OS之前禁用传统串口重定向功能。默认设置为始终启用，即进入传统OS后，传统串口重定向仍然保持开启。"
#string STR_ALWAY_ENABLE                        #language zh-chs "始终启用"
#string STR_BOOTLOADER                          #language zh-chs "引导模式"
#string STR_COM_FOR_LEGACY_REDIRECTION_HELP     #language zh-chs "选择一个串口来显示传统系统或者传统OPROM的信息"

//******************************************************************************
//******************************************************************************
//**                                                                          **
//** Copyright(C) 2020-2021, XCradle Electronic Information Industry Co., Ltd. **
//**                                                                          **
//**                          All Rights Reserved.                            **
//**                                                                          **
//******************************************************************************
//******************************************************************************